ryanuo/cstudy/exercises/stm32/test1/src/func/buzzer.c
#include "buzzer.h"
#include "stm32f1xx_hal.h"

#define BUZZER_PIN  GPIO_PIN_6
#define BUZZER_PORT GPIOA

void Buzzer_Init(void)
{
    __HAL_RCC_GPIOA_CLK_ENABLE();
    GPIO_InitTypeDef gpio = {0};
    gpio.Pin   = BUZZER_PIN;
    gpio.Mode  = GPIO_MODE_OUTPUT_PP;
    gpio.Pull  = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(BUZZER_PORT, &gpio);
    HAL_GPIO_WritePin(BUZZER_PORT, BUZZER_PIN, GPIO_PIN_SET);
}

void Buzzer_Stop(void)
{
    HAL_GPIO_WritePin(BUZZER_PORT, BUZZER_PIN, GPIO_PIN_SET);
}

void Buzzer_Start(void)
{
    HAL_GPIO_WritePin(BUZZER_PORT, BUZZER_PIN, GPIO_PIN_RESET);
}

static volatile uint8_t s_abort = 0;

void Buzzer_PlayNote(uint16_t freq, uint16_t duration)
{
    if (freq == NOTE_REST) {
        uint32_t waited = 0;
        while (waited < duration) {
            if (s_abort) return;
            HAL_Delay(10);
            waited += 10;
        }
        return;
    }
    uint32_t half_us = 500000 / freq;
    uint32_t cycles = (uint32_t)duration * 1000 / (half_us * 2);
    for (uint32_t c = 0; c < cycles; c++) {
        if (s_abort) return;
        HAL_GPIO_WritePin(BUZZER_PORT, BUZZER_PIN, GPIO_PIN_RESET);
        for (volatile uint32_t d = 0; d < half_us * 7; d++);
        HAL_GPIO_WritePin(BUZZER_PORT, BUZZER_PIN, GPIO_PIN_SET);
        for (volatile uint32_t d = 0; d < half_us * 7; d++);
    }
}

void Buzzer_PlayMusic(const MusicNote_t *music, uint16_t length, uint16_t beat_ms)
{
    for (uint16_t i = 0; i < length; i++) {
        if (s_abort) break;
        uint32_t duration = ((uint32_t)beat_ms * music[i].beat) / 4;
        Buzzer_PlayNote(music[i].freq, duration);
    }
    s_abort = 0;
}

/* 起风了 乐谱 */
static const MusicNote_t song_qifengle[] = {
    {NOTE_M7, 1}, {NOTE_H1, 1}, {NOTE_H2, 1}, {NOTE_H3, 1},
    {NOTE_M3, 2}, {NOTE_H5, 1}, {NOTE_H3, 1}, {NOTE_H3, 2},
    {NOTE_REST, 4},
    {NOTE_M7, 1}, {NOTE_H1, 1}, {NOTE_H2, 1}, {NOTE_H3, 1},
    {NOTE_M2, 2}, {NOTE_H5, 1}, {NOTE_H3, 1}, {NOTE_H2, 1},
    {NOTE_H3, 1}, {NOTE_H1, 1}, {NOTE_H2, 1}, {NOTE_M7, 1},
    {NOTE_H1, 1}, {NOTE_M5, 1}, {NOTE_REST, 4}, {NOTE_REST, 4},
    {NOTE_M7, 1}, {NOTE_H1, 1}, {NOTE_H2, 1}, {NOTE_H3, 1},
    {NOTE_M3, 2}, {NOTE_H5, 1}, {NOTE_H3, 1}, {NOTE_H3, 2},
    {NOTE_REST, 4},
    {NOTE_M7, 1}, {NOTE_H1, 1}, {NOTE_H2, 1}, {NOTE_H3, 1},
    {NOTE_M2, 2}, {NOTE_H5, 1}, {NOTE_H3, 1}, {NOTE_H2, 1},
    {NOTE_H3, 1}, {NOTE_H1, 1}, {NOTE_H2, 1}, {NOTE_M7, 1},
    {NOTE_H1, 1}, {NOTE_M5, 1}, {NOTE_REST, 4}, {NOTE_REST, 4},
    {NOTE_M2, 4}, {NOTE_M1, 1}, {NOTE_M2, 4}, {NOTE_M1, 1},
    {NOTE_M2, 2}, {NOTE_M3, 2}, {NOTE_M5, 2}, {NOTE_M3, 2},
    {NOTE_REST, 4},
    {NOTE_M2, 4}, {NOTE_M1, 1}, {NOTE_M2, 4}, {NOTE_M1, 1},
    {NOTE_M2, 1}, {NOTE_M3, 1}, {NOTE_M2, 1}, {NOTE_M1, 1},
    {NOTE_M1, 2}, {NOTE_REST, 4}, {NOTE_REST, 4},
    {NOTE_M2, 4}, {NOTE_M1, 1}, {NOTE_M2, 4}, {NOTE_M1, 1},
    {NOTE_M2, 2}, {NOTE_M3, 2}, {NOTE_M5, 2}, {NOTE_M3, 2},
    {NOTE_REST, 4},
    {NOTE_M2, 4}, {NOTE_M3, 1}, {NOTE_M2, 2}, {NOTE_M1, 1},
    {NOTE_M2, 1}, {NOTE_M2, 4}, {NOTE_REST, 4}, {NOTE_REST, 4},
    {NOTE_M2, 4}, {NOTE_M1, 1}, {NOTE_M2, 4}, {NOTE_M1, 1},
    {NOTE_M2, 2}, {NOTE_M3, 2}, {NOTE_M5, 2}, {NOTE_M3, 2},
    {NOTE_REST, 4},
    {NOTE_M2, 4}, {NOTE_M3, 1}, {NOTE_M2, 2}, {NOTE_M1, 1},
    {NOTE_L6, 4}, {NOTE_REST, 4},
    {NOTE_M3, 1}, {NOTE_M2, 1}, {NOTE_M1, 1}, {NOTE_M2, 1},
    {NOTE_REST, 4}, {NOTE_M1, 2}, {NOTE_REST, 4},
    {NOTE_M3, 1}, {NOTE_M2, 1}, {NOTE_M1, 1}, {NOTE_M2, 1},
    {NOTE_M1, 2}, {NOTE_M3, 1}, {NOTE_M2, 1}, {NOTE_M1, 1}, {NOTE_M2, 1},
    {NOTE_M1, 2},
    {NOTE_M1, 2}, {NOTE_M2, 2}, {NOTE_M3, 2}, {NOTE_M1, 2},
    {NOTE_M6, 2}, {NOTE_M5, 1}, {NOTE_M6, 2}, {NOTE_REST, 4},
    {NOTE_M1, 1}, {NOTE_M7, 2}, {NOTE_M6, 1}, {NOTE_M7, 4},
    {NOTE_REST, 4}, {NOTE_REST, 4},
    {NOTE_M7, 2}, {NOTE_M6, 1}, {NOTE_M7, 2}, {NOTE_M3, 2},
    {NOTE_M1, 1}, {NOTE_M2, 1}, {NOTE_M1, 1}, {NOTE_M7, 1},
    {NOTE_M6, 2}, {NOTE_REST, 4},
    {NOTE_M5, 2}, {NOTE_M6, 2}, {NOTE_M5, 1}, {NOTE_M6, 2},
    {NOTE_M5, 1}, {NOTE_M6, 1}, {NOTE_M5, 1}, {NOTE_M6, 2},
    {NOTE_M5, 1}, {NOTE_M2, 2}, {NOTE_M5, 1}, {NOTE_REST, 4},
    {NOTE_M5, 1}, {NOTE_M3, 2}, {NOTE_M3, 2},
    {NOTE_M1, 2}, {NOTE_M2, 2}, {NOTE_M3, 2}, {NOTE_M1, 2},
    {NOTE_M6, 2}, {NOTE_M5, 1}, {NOTE_M6, 4}, {NOTE_REST, 4},
    {NOTE_M1, 1}, {NOTE_M7, 2}, {NOTE_M6, 1}, {NOTE_M7, 4},
    {NOTE_REST, 4}, {NOTE_M7, 2}, {NOTE_M6, 1}, {NOTE_M7, 4},
    {NOTE_M3, 2}, {NOTE_H1, 1}, {NOTE_H2, 1}, {NOTE_H1, 1}, {NOTE_M7, 1},
    {NOTE_M6, 1},
    {NOTE_M5, 2}, {NOTE_M6, 2}, {NOTE_H3, 1}, {NOTE_H3, 4},
    {NOTE_M5, 2}, {NOTE_M6, 2}, {NOTE_H3, 1}, {NOTE_H3, 2},
    {NOTE_M5, 1}, {NOTE_M6, 8},
    {NOTE_H1, 2}, {NOTE_H2, 2}, {NOTE_H3, 2}, {NOTE_H6, 1},
    {NOTE_H5, 2}, {NOTE_H6, 1}, {NOTE_H5, 2}, {NOTE_H6, 1},
    {NOTE_H5, 4}, {NOTE_H2, 1}, {NOTE_H3, 4}, {NOTE_H6, 1},
    {NOTE_H5, 4}, {NOTE_H6, 1}, {NOTE_H5, 4}, {NOTE_H6, 1},
    {NOTE_H5, 2}, {NOTE_H3, 1}, {NOTE_H3, 4}, {NOTE_REST, 4},
    {NOTE_H2, 1}, {NOTE_H2, 1}, {NOTE_H1, 1}, {NOTE_M6, 2},
    {NOTE_H1, 2}, {NOTE_H1, 1}, {NOTE_H2, 1}, {NOTE_H2, 1}, {NOTE_H1, 1}, {NOTE_M6, 1},
    {NOTE_H1, 2}, {NOTE_H3, 6}, {NOTE_H3, 1}, {NOTE_H2, 1},
    {NOTE_H3, 1}, {NOTE_H2, 2}, {NOTE_REST, 4},
    {NOTE_H1, 2}, {NOTE_H2, 2}, {NOTE_H3, 2}, {NOTE_H6, 1},
    {NOTE_H5, 4}, {NOTE_H6, 1}, {NOTE_H5, 4}, {NOTE_H6, 1},
    {NOTE_H5, 2}, {NOTE_REST, 4},
    {NOTE_H2, 1}, {NOTE_H3, 2}, {NOTE_H6, 1}, {NOTE_H5, 4},
    {NOTE_H6, 1}, {NOTE_H5, 4}, {NOTE_H6, 1}, {NOTE_H5, 2},
    {NOTE_H3, 2}, {NOTE_REST, 4},
    {NOTE_H3, 6}, {NOTE_H2, 2}, {NOTE_H1, 1}, {NOTE_M6, 2},
    {NOTE_H3, 2}, {NOTE_H2, 2}, {NOTE_H1, 1}, {NOTE_M6, 2},
    {NOTE_M6, 1}, {NOTE_H1, 1}, {NOTE_H1, 4},
};

/* 青花瓷 乐谱 */
static const MusicNote_t song_qinghuaci[] = {
    {NOTE_M4, 4}, {NOTE_M5, 4}, {NOTE_M6, 4}, {NOTE_M5, 4}, {NOTE_M4, 4}, {NOTE_M4, 8}, {NOTE_REST, 2},
    {NOTE_M1, 4}, {NOTE_M2, 4}, {NOTE_M4, 4}, {NOTE_M4, 4}, {NOTE_M1, 12}, {NOTE_REST, 4},
    {NOTE_M4, 4}, {NOTE_M5, 4}, {NOTE_M6, 4}, {NOTE_M5, 4}, {NOTE_M4, 4}, {NOTE_M4, 4},
    {NOTE_M5, 4}, {NOTE_M4, 2}, {NOTE_M2, 2}, {NOTE_M1, 4}, {NOTE_M2, 12}, {NOTE_REST, 4},
    {NOTE_M4, 4}, {NOTE_M5, 4}, {NOTE_M6, 4}, {NOTE_M5, 4}, {NOTE_M4, 4}, {NOTE_M4, 8}, {NOTE_REST, 2},
    {NOTE_M1, 4}, {NOTE_M2, 4}, {NOTE_M4, 4}, {NOTE_M4, 4}, {NOTE_M1, 12}, {NOTE_REST, 4},
    {NOTE_M4, 4}, {NOTE_M5, 4}, {NOTE_M4, 4}, {NOTE_M2, 4}, {NOTE_M1, 4}, {NOTE_M2, 4},
    {NOTE_M1, 4}, {NOTE_L6, 8}, {NOTE_M1, 16},
};

void Buzzer_Play(uint8_t song_id)
{
    switch (song_id) {
        case 1:
            Buzzer_PlayMusic(song_qifengle, sizeof(song_qifengle) / sizeof(MusicNote_t), 500);
            break;
        case 2:
            Buzzer_PlayMusic(song_qinghuaci, sizeof(song_qinghuaci) / sizeof(MusicNote_t), 500);
            break;
        default:
            break;
    }
}
